nxp-mcuxpresso/mcux-soc-svd/MCXN946/MCXN946_cm33_core1.xml
        <register>
          <name>SM3CAPTFILTB</name>
          <description>Capture PWM_B Input Filter Register</description>
          <addressOffset>0x17C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CAPTB_FILT_PER</name>
              <description>Input Capture Filter Period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPTB_FILT_CNT</name>
              <description>Input Capture Filter Count</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SM3CAPTFILTX</name>
          <description>Capture PWM_X Input Filter Register</description>
          <addressOffset>0x17E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>CAPTX_FILT_PER</name>
              <description>Input Capture Filter Period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPTX_FILT_CNT</name>
              <description>Input Capture Filter Count</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTEN</name>
          <description>Output Enable Register</description>
          <addressOffset>0x180</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>PWMX_EN</name>
              <description>PWM_X Output Enables</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWMB_EN</name>
              <description>PWM_B Output Enables</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWMA_EN</name>
              <description>PWM_A Output Enables</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK</name>
          <description>Mask Register</description>
          <addressOffset>0x182</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>MASKX</name>
              <description>PWM_X Masks</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASKB</name>
              <description>PWM_B Masks</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASKA</name>
              <description>PWM_A Masks</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UPDATE_MASK</name>
              <description>Update Mask Bits Immediately</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWCOUT</name>
          <description>Software Controlled Output Register</description>
          <addressOffset>0x184</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SM0OUT45</name>
              <description>Submodule 0 Software Controlled Output 45</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOGIC_0</name>
                  <description>A logic 0 is supplied to the deadtime generator of submodule 0 instead of PWM45.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOGIC_1</name>
                  <description>A logic 1 is supplied to the deadtime generator of submodule 0 instead of PWM45.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM0OUT23</name>
              <description>Submodule 0 Software Controlled Output 23</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOGIC_0</name>
                  <description>A logic 0 is supplied to the deadtime generator of submodule 0 instead of PWM23.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOGIC_1</name>
                  <description>A logic 1 is supplied to the deadtime generator of submodule 0 instead of PWM23.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM1OUT45</name>
              <description>Submodule 1 Software Controlled Output 45</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOGIC_0</name>
                  <description>A logic 0 is supplied to the deadtime generator of submodule 1 instead of PWM45.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOGIC_1</name>
                  <description>A logic 1 is supplied to the deadtime generator of submodule 1 instead of PWM45.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM1OUT23</name>
              <description>Submodule 1 Software Controlled Output 23</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOGIC_0</name>
                  <description>A logic 0 is supplied to the deadtime generator of submodule 1 instead of PWM23.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOGIC_1</name>
                  <description>A logic 1 is supplied to the deadtime generator of submodule 1 instead of PWM23.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM2OUT45</name>
              <description>Submodule 2 Software Controlled Output 45</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOGIC_0</name>
                  <description>A logic 0 is supplied to the deadtime generator of submodule 2 instead of PWM45.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOGIC_1</name>
                  <description>A logic 1 is supplied to the deadtime generator of submodule 2 instead of PWM45.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM2OUT23</name>
              <description>Submodule 2 Software Controlled Output 23</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOGIC_0</name>
                  <description>A logic 0 is supplied to the deadtime generator of submodule 2 instead of PWM23.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOGIC_1</name>
                  <description>A logic 1 is supplied to the deadtime generator of submodule 2 instead of PWM23.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM3OUT45</name>
              <description>Submodule 3 Software Controlled Output 45</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOGIC_0</name>
                  <description>A logic 0 is supplied to the deadtime generator of submodule 3 instead of PWM45.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOGIC_1</name>
                  <description>A logic 1 is supplied to the deadtime generator of submodule 3 instead of PWM45.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM3OUT23</name>
              <description>Submodule 3 Software Controlled Output 23</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOGIC_0</name>
                  <description>A logic 0 is supplied to the deadtime generator of submodule 3 instead of PWM23.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOGIC_1</name>
                  <description>A logic 1 is supplied to the deadtime generator of submodule 3 instead of PWM23.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DTSRCSEL</name>
          <description>PWM Source Select Register</description>
          <addressOffset>0x186</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SM0SEL45</name>
              <description>Submodule 0 PWM45 Control Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SM0PWM45</name>
                  <description>Generated SM0PWM45 signal used by the deadtime logic.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED_SM0PWM45</name>
                  <description>Inverted generated SM0PWM45 signal used by the deadtime logic.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM0OUT45</name>
                  <description>SWCOUT[SM0OUT45] used by the deadtime logic.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM0SEL23</name>
              <description>Submodule 0 PWM23 Control Select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SM0PWM23</name>
                  <description>Generated SM0PWM23 signal used by the deadtime logic.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED_SM0PWM23</name>
                  <description>Inverted generated SM0PWM23 signal used by the deadtime logic.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM0OUT23</name>
                  <description>SWCOUT[SM0OUT23] used by the deadtime logic.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM0_EXTA</name>
                  <description>PWM0_EXTA signal used by the deadtime logic.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM1SEL45</name>
              <description>Submodule 1 PWM45 Control Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SM1PWM45</name>
                  <description>Generated SM1PWM45 signal used by the deadtime logic.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED_SM1PWM45</name>
                  <description>Inverted generated SM1PWM45 signal used by the deadtime logic.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM1OUT45</name>
                  <description>SWCOUT[SM1OUT45] used by the deadtime logic.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM1SEL23</name>
              <description>Submodule 1 PWM23 Control Select</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SM1PWM23</name>
                  <description>Generated SM1PWM23 signal used by the deadtime logic.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED_SM1PWM23</name>
                  <description>Inverted generated SM1PWM23 signal used by the deadtime logic.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM1OUT23</name>
                  <description>SWCOUT[SM1OUT23] used by the deadtime logic.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM1_EXTA</name>
                  <description>PWM1_EXTA signal used by the deadtime logic.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM2SEL45</name>
              <description>Submodule 2 PWM45 Control Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SM2PWM45</name>
                  <description>Generated SM2PWM45 signal used by the deadtime logic.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED_SM2PWM45</name>
                  <description>Inverted generated SM2PWM45 signal used by the deadtime logic.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM2OUT45</name>
                  <description>SWCOUT[SM2OUT45] used by the deadtime logic.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM2SEL23</name>
              <description>Submodule 2 PWM23 Control Select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SM2PWM23</name>
                  <description>Generated SM2PWM23 signal used by the deadtime logic.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED_SM2PWM23</name>
                  <description>Inverted generated SM2PWM23 signal used by the deadtime logic.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM2OUT23</name>
                  <description>SWCOUT[SM2OUT23] used by the deadtime logic.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM2_EXTA</name>
                  <description>PWM2_EXTA signal used by the deadtime logic.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM3SEL45</name>
              <description>Submodule 3 PWM45 Control Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SM3PWM45</name>
                  <description>Generated SM3PWM45 signal used by the deadtime logic.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED_SM3PWM45</name>
                  <description>Inverted generated SM3PWM45 signal used by the deadtime logic.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM3OUT45</name>
                  <description>SWCOUT[SM3OUT45] used by the deadtime logic.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SM3SEL23</name>
              <description>Submodule 3 PWM23 Control Select</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SM3PWM23</name>
                  <description>Generated SM3PWM23 signal used by the deadtime logic.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED_SM3PWM23</name>
                  <description>Inverted generated SM3PWM23 signal used by the deadtime logic.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SM3OUT23</name>
                  <description>SWCOUT[SM3OUT23] used by the deadtime logic.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWM3_EXTA</name>
                  <description>PWM3_EXTA signal used by the deadtime logic.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
