nxp-mcuxpresso/mcux-soc-svd/MCXN946/MCXN946_cm33_core1.xml
          <register>
            <name>CDR</name>
            <description>Channel n Data Rate</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x1800</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PFOSR</name>
                <description>PF OSR</description>
                <bitOffset>0</bitOffset>
                <bitWidth>11</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PFORD</name>
                <description>PF Order</description>
                <bitOffset>11</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FASTSINC</name>
                    <description>FastSinc</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ORDER_1</name>
                    <description>First order</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ORDER_2</name>
                    <description>Second order</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ORDER_3</name>
                    <description>Third order</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PFCM</name>
                <description>PF Conversion Mode</description>
                <bitOffset>14</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SINGLE</name>
                    <description>Single</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CONTINUOUS</name>
                    <description>Continuous</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ALWAYS</name>
                    <description>Always</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FIX</name>
                    <description>Fixed number</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CCFR</name>
            <description>Channel n Configuration</description>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x200000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PFSFT</name>
                <description>PF Shift</description>
                <bitOffset>0</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RDFMT</name>
                <description>Result Data Format</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SIGNED</name>
                    <description>Left justified, signed</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UNSIGNED</name>
                    <description>Left justified, unsigned</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FIFOWMK</name>
                <description>FIFO Watermark</description>
                <bitOffset>10</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IBFMT</name>
                <description>Input Bit Format</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>E1B</name>
                    <description>External bitstream from the MBIT[n] signal</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EMB</name>
                    <description>External Manchester code; ICESEL selects the rise or fall decoder</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IPB</name>
                    <description>Internal 16-bit parallel data from MPDATA</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ISB</name>
                    <description>Internal 32-bit serial data from MPDATA</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ICSEL</name>
                <description>Input Clock Select</description>
                <bitOffset>18</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MCLK_OUT0</name>
                    <description>MCLK_OUT0 with internal routeback</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MCLK_OUT1</name>
                    <description>MCLK_OUT1 with internal routeback</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MCLK_OUT2</name>
                    <description>MCLK_OUT2 with internal routeback</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EXT</name>
                    <description>External modulator clock dedicated to this channel</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GRP</name>
                    <description>Grouped clock shared with an adjacent channel; the adjacent channel's ICSEL field determines the input clock</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ICESEL</name>
                <description>Input Clock Edge Select</description>
                <bitOffset>21</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>POS</name>
                    <description>Positive edge</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NEG</name>
                    <description>Negative edge</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BOTH</name>
                    <description>Both edges</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPOS</name>
                    <description>Every other odd positive edge</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EPOS</name>
                    <description>Every other even positive edge</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ONEG</name>
                    <description>Every other odd negative edge</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENEG</name>
                    <description>Every other even negative edge</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ITSEL</name>
                <description>Input Trigger Select</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SW</name>
                    <description>Software</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HW</name>
                    <description>Hardware trigger dedicated to the channel</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GP</name>
                    <description>Grouped trigger shared with an adjacent channel; the adjacent channel's ITSEL field determines the trigger</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IBSEL</name>
                <description>Input Bit Select</description>
                <bitOffset>26</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>EPB</name>
                    <description>External bitstream from the MBIT[n] signal</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ESB</name>
                    <description>Alternate internal bitstream from the INP[n] signal</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GRP</name>
                    <description>Grouped bitstream shared with an adjacent channel; the adjacent channel's IBSEL field determines the input</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ITLVL</name>
                <description>Input Trigger Level Type</description>
                <bitOffset>28</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>EDGE</name>
                    <description>Edge</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LEVEL</name>
                    <description>Level</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ZCOP</name>
                <description>Zero Cross Option</description>
                <bitOffset>30</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>BOTH</name>
                    <description>Both rise and fall</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FALL</name>
                    <description>Fall</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RISE</name>
                    <description>Rise</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CPROT</name>
            <description>Channel n Protection</description>
            <addressOffset>0xC</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SCDLMT</name>
                <description>SCD Limit Threshold</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLES_0</name>
                    <description>Disables SCD</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DISABLES_1</name>
                    <description>Disables SCD</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SCDCM</name>
                <description>SCD Conversion Mode</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ALWAYS</name>
                    <description>Constantly when CnCR[CHEN] = MCR[MEN] = 1</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DURING_CONV</name>
                    <description>Only when the PF is performing a conversion</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SCDOP</name>
                <description>SCD Option</description>
                <bitOffset>12</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>BOTH</name>
                    <description>Both 0 and 1</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ONE</name>
                    <description>Only 1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ZERO</name>
                    <description>Only 0</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LMTOP</name>
                <description>Limit Detection Option</description>
                <bitOffset>14</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>BOTH</name>
                    <description>Both high and low limits</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HIGH</name>
                    <description>High limit</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LOW</name>
                    <description>Low limit</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>WINDOW</name>
                    <description>Windowed value</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CADLMT</name>
                <description>CAD Limit Threshold</description>
                <bitOffset>16</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLES</name>
                    <description>Disables CAD</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CADBK</name>
                <description>CAD Break Signal</description>
                <bitOffset>26</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLES</name>
                    <description>Disables</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLES</name>
                    <description>Enables</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SCDBK</name>
                <description>SCD Break Signal</description>
                <bitOffset>27</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLES</name>
                    <description>Disables</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLES</name>
                    <description>Enables</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LLMTBK</name>
                <description>Low Limit Break Signal</description>
                <bitOffset>29</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLES</name>
                    <description>Disables</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLES</name>
                    <description>Enables</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WLMTBK</name>
                <description>Window Limit Break Signal</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLES</name>
                    <description>Disables</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLES</name>
                    <description>Enables</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>HLMTBK</name>
                <description>High Limit Break Signal</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLES</name>
                    <description>Disables</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLES</name>
                    <description>Enables</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CBIAS</name>
            <description>Channel n Bias</description>
            <addressOffset>0x10</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>BIAS</name>
                <description>Bias Value</description>
                <bitOffset>8</bitOffset>
                <bitWidth>24</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CLOLMT</name>
            <description>Channel n Low Limit</description>
            <addressOffset>0x14</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>LOLMT</name>
                <description>Low Limit Threshold</description>
                <bitOffset>8</bitOffset>
                <bitWidth>24</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CHILMT</name>
            <description>Channel n High Limit</description>
            <addressOffset>0x18</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>HILMT</name>
                <description>High Limit Threshold</description>
                <bitOffset>8</bitOffset>
                <bitWidth>24</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
